Creating a series using array()

In [5]:
import pandas as pd
import numpy as np  
data = np.array(['r','a','d','h','i','k','a'])
ser = pd.Series(data)
print(ser)

0    r
1    a
2    d
3    h
4    i
5    k
6    a
dtype: object

In [6]:
import pandas as pd
list = ['r','a','d','h','i','k','a']
ser = pd.Series(list)
print(ser)

0    r
1    a
2    d
3    h
4    i
5    k
6    a
dtype: object

Accessing element of Series
There are two ways through which we can access element of series, they are :

Accessing Element from Series with Position
Accessing Element Using Label (index)

In [7]:
import pandas as pd
import numpy as np
data = np.array(['H','i','r','a','d','h','i','k','a'])
ser = pd.Series(data)
print(ser[:5])

0    H
1    i
2    r
3    a
4    d
dtype: object

In [8]:
import pandas as pd
import numpy as np
data = np.array(['H','i','r','a','d','h','i','k','a'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18])
print(ser[16])

i

Indexing and Selecting Data in Series

In [12]:
import pandas as pd  
df = pd.read_excel("nba.xlsx")  
ser = pd.Series(df['Name']) 
data = ser.head(10)
data

0     Radhika
1      Kaavya
2     Varnika
3     Anubhav
4     kuldeep
5      Aayush
6    Abhijeet
7       Naman
8      Vedant
Name: Name, dtype: object

In [13]:
data[3:5]

3    Anubhav
4    kuldeep
Name: Name, dtype: object

In [14]:
import pandas as pd   
df = pd.read_excel("nba.xlsx")  
ser = pd.Series(df['Name']) 
data = ser.head(10)
data

0     Radhika
1      Kaavya
2     Varnika
3     Anubhav
4     kuldeep
5      Aayush
6    Abhijeet
7       Naman
8      Vedant
Name: Name, dtype: object

In [15]:
data.loc[3:6]

3     Anubhav
4     kuldeep
5      Aayush
6    Abhijeet
Name: Name, dtype: object

In [17]:
import pandas as pd  
df = pd.read_excel("nba.xlsx")  
ser = pd.Series(df['Name']) 
data = ser.head(10)
data

0     Radhika
1      Kaavya
2     Varnika
3     Anubhav
4     kuldeep
5      Aayush
6    Abhijeet
7       Naman
8      Vedant
Name: Name, dtype: object

In [18]:
data.iloc[3:6]

3    Anubhav
4    kuldeep
5     Aayush
Name: Name, dtype: object

Binary operation on series

In [19]:
import pandas as pd  
data = pd.Series([5, 2, 3,7], index=['a', 'b', 'c', 'd'])
data1 = pd.Series([1, 6, 4, 9], index=['a', 'b', 'd', 'e'])
print(data, "\n\n", data1)

a    5
b    2
c    3
d    7
dtype: int64

 a    1
b    6
d    4
e    9
dtype: int64

In [21]:
data.add(data1, fill_value=0)

a     6.0
b     8.0
c     3.0
d    11.0
e     9.0
dtype: float64

In [22]:
data.sub(data1, fill_value=0)

a    4.0
b   -4.0
c    3.0
d    3.0
e   -9.0
dtype: float64

In [24]:
import pandas as pd 
data = pd.read_excel("nba.xlsx") 
data.dropna(inplace = True) 
before = data.dtypes 
data["Salary"]= data["Salary"].astype(int) 
data["Last Name"]= data["Last Name"].astype(str) 
after = data.dtypes 
print("BEFORE CONVERSION\n", before, "\n") 
print("AFTER CONVERSION\n", after, "\n")

BEFORE CONVERSION
 Name         object
Salary        int64
Last Name    object
dtype: object

AFTER CONVERSION
 Name         object
Salary        int32
Last Name    object
dtype: object

In [26]:
import pandas as pd  
import re 
data = pd.read_excel("nba.xlsx")  
data.dropna(inplace = True)  
dtype_before = type(data["Salary"]) 
salary_list = data["Salary"].tolist() 
dtype_after = type(salary_list) 
print("Data type before converting = {}\nData type after converting = {}"
      .format(dtype_before, dtype_after)) 
salary_list

Data type before converting = <class 'pandas.core.series.Series'>
Data type after converting = <class 'list'>

[100, 188, 1220, 220, 129, 5677, 6789, 890, 7689]

DATA FRAME

In [28]:
import pandas as pd
lst = ['hi', 'I', 'am', 'Radhika','Gupta', 'from', 'GBU']
df = pd.DataFrame(lst)
print(df)

         0
0       hi
1        I
2       am
3  Radhika
4    Gupta
5     from
6      GBU

In [29]:
import pandas as pd
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [30]:
import pandas as pd
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
df = pd.DataFrame(data)
print(df[['Name', 'Qualification']])

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [31]:
import pandas as pd
data = pd.read_excel("nba.xlsx", index_col ="Name")
first = data.loc["Radhika"]
second = data.loc["Kaavya"]
print(first, "\n\n\n", second)

Salary         100
Last Name    Gupta
Name: Radhika, dtype: object


 Salary         188
Last Name    Singh
Name: Kaavya, dtype: object

Indexing and selecting

In [35]:
import pandas as pd
data = pd.read_excel("nba.xlsx", index_col ="Name")
first = data["Salary"]
print(first)

Name
Radhika      100
Kaavya       188
Varnika     1220
Anubhav      220
kuldeep      129
Aayush      5677
Abhijeet    6789
Naman        890
Vedant      7689
Name: Salary, dtype: int64

In [37]:
import pandas as pd
data = pd.read_excel("nba.xlsx", index_col ="Name")
first = data.loc["Radhika"]
print(first)

Salary         100
Last Name    Gupta
Name: Radhika, dtype: object

In [39]:
import pandas as pd
import numpy as np
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
df = pd.DataFrame(dict)
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [40]:
import pandas as pd
import numpy as np
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
df = pd.DataFrame(dict)
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [42]:
import pandas as pd
dict = {'name':["Aparna", "Radhika", "Shivam", "Prakhar"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)
print(df)

      name  degree  score
0   Aparna     MBA     90
1  Radhika     BCA     40
2   Shivam  M.Tech     80
3  Prakhar     MBA     98

In [44]:
import pandas as pd
dict = {'name':["Aparna", "Radhika"],
        'degree': ["MBA", "BCA"],
        'score':[90, 40]}
df = pd.DataFrame(dict)
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      Aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      Radhika
degree        BCA
score          40
Name: 1, dtype: object

In [48]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)
print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98